Revit 2023 API
RebarBarType.BarModelDiameter Property
 Defines bar model diameter of rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2022
Syntax
C#
public double BarModelDiameter { get; set; }
Visual Basic
Public Property BarModelDiameter As Double
	Get
	Set
Visual C++
public:
property double BarModelDiameter {
	double get ();
	void set (double value);
}
Field Value
 The bar model diameter of rebar
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: the bar diameter barModelDiam is not positive or bigger than the smallest value of 1.0, and current internal values of standard bend diameter, standard hook bend diameter and stirrup/tie bend diameter
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace